# CYPLAN255
### Urban Informatics and Visualization

HIT RECORD and TRANSCRIBE

# Lecture 08 -- Data Analysis
*******
February 16, 2022

# Agenda
1. Announcements
2. Review of last session
3. Data Analysis
4. For next time
5. Questions

# 1. Announcements

1. Assignment 2 due _Sunday_
2. Update to GitHub guide
3. Dante and Virgil

## 1.3 Dante and Virgil

<img src="https://upload.wikimedia.org/wikipedia/commons/7/70/Eug%C3%A8ne_Delacroix_-_The_Barque_of_Dante.jpg" width=50%>

_The Barque of Dante_, Eugène Delacroix (1822)

# 2. Review from Intro to Data Analysis

## 2.1 Indexing and Selecting

- use `[<row>, <column>]` indexing with `loc` (labels) and `iloc` (positions)
- use `df[<col>]` to select a column/Series from a DataFrame by column label
- use `df[[<col1>, <col2>]]` to select a subset of a DataFrame by column label

## 2.2 Merge Methods

Most of the below is taken directly from the pandas [docs](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html#brief-primer-on-merge-methods-relational-algebra).

There are 4 main types of merges, but all of them require **four** arguments:
- `left`: first `DataFrame` or `Series` to merge
- `right`: second `DataFrame` or `Series` to merge with the first 
- `on`: the name of the "key" column(s) you'll use to identify matching/corresponding rows in each table
- `how`: the type of merge to perform (default is "inner")

Let's see how this works in practice. First we'll create some data:

In [1]:
import pandas as pd

left = pd.DataFrame(

    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }

)

right = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

And now we'll do some merges

**inner** join
![](https://pandas.pydata.org/pandas-docs/stable/_images/merging_merge_on_key_multiple.png)

In [2]:
pd.merge(left, right, on=["key1", "key2"])  
# inner is default "how", so we don't need to specify it
# will return rows that match on key 1 and key 2 --> everything joins except row 3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

**left** join
![](https://pandas.pydata.org/pandas-docs/stable/_images/merging_merge_on_key_left.png)

In [3]:
pd.merge(left, right, how="left", on=["key1", "key2"])
# Python preserves all rows in LEFT table even if there's no matches

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

**right** join
![](https://pandas.pydata.org/pandas-docs/stable/_images/merging_merge_on_key_right.png)

In [4]:
pd.merge(left, right, how="right", on=["key1", "key2"])
# Python preserves all rows in RIGHT table even if there's no matches
# Pandas will fill empty spaces (null) with 'NaN' (= 'not a number')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

**outer** (A.K.A. full) join
![](https://pandas.pydata.org/pandas-docs/stable/_images/merging_merge_on_key_outer.png)

In [ ]:
pd.merge(left, right, how="outer", on=["key1", "key2"])
# OUTER join is left and right join at the same time
# does not drop any rows & guarantees NaN entries

**cross** join (A.K.A. Cartesian Product)
![](https://pandas.pydata.org/pandas-docs/stable/_images/merging_merge_cross.png)

In [5]:
pd.merge(left, right, how="cross").head()
# preserves all possible combinations of all values in tables
# To preserve all columns, including those with the same same, Python automatically
# appends suffixes to indicate which table they came from

  key1_x key2_x   A   B key1_y key2_y   C   D
0     K0     K0  A0  B0     K0     K0  C0  D0
1     K0     K0  A0  B0     K1     K0  C1  D1
2     K0     K0  A0  B0     K1     K0  C2  D2
3     K0     K0  A0  B0     K2     K0  C3  D3
4     K0     K1  A1  B1     K0     K0  C0  D0

## 2.3 Handling duplicate column names

In [6]:
left = pd.DataFrame({"A": [4, 5], "B": [2, 2], "C": [5, 7]})
right = pd.DataFrame({"A": [4, 5, 6], "B": [2, 2, 2], "D": [9, 8, 1]})
pd.merge(left, right, on="B", how="inner")
# merging on B --> Pandas doesn't know what to do with A

   A_x  B  C  A_y  D
0    4  2  5    4  9
1    4  2  5    5  8
2    4  2  5    6  1
3    5  2  7    4  9
4    5  2  7    5  8
5    5  2  7    6  1

In [7]:
pd.merge(left, right, on=["A", "B"], how="inner")
# merging on A AND B

   A  B  C  D
0  4  2  5  9
1  5  2  7  8

### 2.3.1 Define your own suffixes!

**Keep all columns, but give them meaningful names**

In [8]:
pd.merge(left, right, on="B", how="inner", suffixes=('_left', '_right'))

   A_left  B  C  A_right  D
0       4  2  5        4  9
1       4  2  5        5  8
2       4  2  5        6  1
3       5  2  7        4  9
4       5  2  7        5  8
5       5  2  7        6  1

**Use suffixes to drop duplicate columns after merge**

In [10]:
result = pd.merge(left, right, on="B", how="inner", suffixes=('_trash', ''))
result

   A_trash  B  C  A  D
0        4  2  5  4  9
1        4  2  5  5  8
2        4  2  5  6  1
3        5  2  7  4  9
4        5  2  7  5  8
5        5  2  7  6  1

In [13]:
# keep only cols you want
good_cols = [col for col in result.columns if not 'trash' in col]
result[good_cols]

good_cols

#LIST COMPREHENSION is a for loop done in 1 line in a list

['B', 'C', 'A', 'D']

In [ ]:
# SAME AS  
good_cols = []
    for col in result.columns
        if not 'trash' in col:
            good_cols.append(col)
'''

In [14]:
# drop cols you don't want ('trash') & tell drop to drop columns using axis=1 (<row>,<column>) = (0,1)
trash_cols = [col for col in result.columns if 'trash' in col]
result.drop(trash_cols, axis=1)  # "axis" tells pandas to drop columns (axis=1) or rows (axis=2)

   B  C  A  D
0  2  5  4  9
1  2  5  5  8
2  2  5  6  1
3  2  7  4  9
4  2  7  5  8
5  2  7  6  1

### 2.3.2 Filter out duplicate columns before you merge!

In [15]:
key = "B"
left_col_mask = [col for col in left.columns if (col not in right.columns) or (col == key)]
pd.merge(left[left_col_mask], right, on="B", how="inner")
# left_col_mask will contain all col from left table than DONT appear in right table + key column
# we need at least 1 col to overlap in order to do merge

   B  C  A  D
0  2  5  4  9
1  2  5  5  8
2  2  5  6  1
3  2  7  4  9
4  2  7  5  8
5  2  7  6  1

# 3. Exploratory Data Analysis with pandas

**READ THE DOCS**

Most of the pandas-related material we saw **yesterday** corresponds to three sections of the pandas user guide:
1. [Basics](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html)
2. [Indexing and Selecting](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)
3. [Merge, join, concatenate, and compare](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)


Most of the material we're covering **today** is also covered in the following three sections of the pandas user guide:
1. [Group by: split-apply-combine](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)
2. [Reshaping and pivot tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html)
3. [Chart visualization](https://pandas.pydata.org/pandas-docs/stable/user_guide/visualization.html)

**Everything** we're covering in pandas is summarized nicely in the [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) section.

## 3.1 The `groupby()` method

For the first part of this lesson, we're going to be analyzing some Bay Area Census data which I've already grabbed for you (specifically the Summary File 1 (SF1) data from the 2010 Census). Refer to the [SF1 Data Dictionary](https://www.census.gov/prod/cen2010/doc/sf1.pdf) to see the list of column codes. I've compiled this data into an HDF5 file, which is kind of like a .zip archive that lets you unzip one file at a time.

In [16]:
sf1 = pd.read_hdf('data/bay_sf1_small.h5', 'sf1_extract')
sf1.head()
# hdf useful when working wiht large data sets bc it allows us to unzip/open one file at a time rather than entire folder

,logrecno,blockfips,state,county,tract,blkgrp,block,arealand,P0010001,P0020001,...,H0040003,H0040004,H0050001,H0050002,H0050003,H0050004,H0050005,H0050006,H0050007,H0050008
0,25,060014271001000,06,001,427100,1,1000,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,26,060014271001001,06,001,427100,1,1001,79696,113,113,...,1,4,0,0,0,0,0,0,0,0
2,27,060014271001002,06,001,427100,1,1002,739,0,0,...,0,0,0,0,0,0,0,0,0,0
3,28,060014271001003,06,001,427100,1,1003,19546,29,29,...,0,7,3,0,0,1,0,0,0,2
4,29,060014271001004,06,001,427100,1,1004,14364,26,26,...,0,6,0,0,0,0,0,0,0,0

**Note on HDF5 dependencies**

pandas uses the `pytables` library to interact with .h5 files. If you don't have it installed and you try to run the cell above, Python may complain. Fear not. Did you know you can execute bash terminal commands directly from a notebook?

In [ ]:
!conda install pytables

# ! allows us to operate bash/Terminal commands from Jupyter notebook!

### 3.1.1 Basic Data Transformations

In the world of machine learning, data transformation is sometimes called **feature extraction**. Both terms refer to the process of taking "raw" input data and manipulating it to create new, useful data. In the example below, we convert population totals to percentages:

In [18]:
sf1['pct_black'] = sf1['P0030003'] / sf1['P0030001'] * 100
sf1['pct_asian'] = sf1['P0030005'] / sf1['P0030001'] * 100
sf1['pct_white'] = sf1['P0030002'] / sf1['P0030001'] * 100
sf1['pct_hisp'] = sf1['P0040003'] / sf1['P0040001'] * 100
sf1.sample(3)

# percent = segment of pop pop / total pop
# output is random sample of 3 rows

,logrecno,blockfips,state,county,tract,blkgrp,block,arealand,P0010001,P0020001,...,H0050003,H0050004,H0050005,H0050006,H0050007,H0050008,pct_black,pct_asian,pct_white,pct_hisp
56011,593703,060750601001073,06,075,060100,1,1073,13789,0,0,...,0,0,0,0,0,0,NaN,NaN,NaN,NaN
45757,315077,060411060021029,06,041,106002,1,1029,10137,19,19,...,0,0,0,0,0,0,0.0,0.0,100.0,0.0
37823,56613,060133551121193,06,013,355112,1,1193,41555,0,0,...,0,0,0,0,0,0,NaN,NaN,NaN,NaN

Now add colums with percentage rental and population per square mile.

In [20]:
sf1['pct_rent'] = sf1['H0040004'] / sf1['H0040001'] * 100
sf1['pct_rent']

# on left, we're creating NEW SERIES from other series
# Pandas automatically appends those new series on the right side of table

0               NaN
1         80.000000
2               NaN
3         70.000000
4         75.000000
            ...
109223          NaN
109224    50.000000
109225    25.714286
109226    50.000000
109227          NaN
Name: pct_rent, Length: 109228, dtype: float64

In [21]:
sf1['pct_rent'] = sf1['H0040004'] / sf1['H0040001'] * 100
sf1['pop_sqmi'] = (sf1['P0010001'] / (sf1['arealand'] / 2589988))
sf1 = sf1[sf1['P0030001'] > 0]
sf1.sample(3)

,logrecno,blockfips,state,county,tract,blkgrp,block,arealand,P0010001,P0020001,...,H0050005,H0050006,H0050007,H0050008,pct_black,pct_asian,pct_white,pct_hisp,pct_rent,pop_sqmi
106125,718563,060971529032010,06,097,152903,2,2010,10527,111,111,...,0,0,0,0,5.405405,7.207207,57.657658,36.936937,47.058824,27309.648333
25928,43761,060133141021015,06,013,314102,1,1015,3166,40,40,...,0,1,0,0,0.000000,0.000000,62.500000,70.000000,6.250000,32722.526848
62634,628320,060816134001018,06,081,613400,1,1018,29190,9,9,...,0,0,0,0,0.000000,22.222222,77.777778,22.222222,25.000000,798.557451

Notice how when we create new columns they get automatically appended to the end (right) of the table

Now let's add county names to the dataframe so we get more readable output. First we'll create a dictionary to map the FIPS codes to county names

In [22]:
county_fips_to_name = {
    '001': 'Alameda', '013': 'Contra Costa', '041': 'Marin', '055': 'Napa', '075': 'San Francisco',
    '081': 'San Mateo', '085': 'Santa Clara', '095': 'Solano', '097': 'Sonoma'}

# Must rename codes to readable names. Use dictionary to map codes to names
# use vectorization to create keys and values

Then we pass that dictionary to the `pd.Series.replace()` method to perform the conversion.

We could use the same assignment-based approach to create our new column:

In [23]:
sf1['county_name'] = sf1['county'].replace(county_fips_to_name)

# passed thru replace method, it will take every row from series and search the value in dictionary 
# will return dictionary value

or we can use `pd.DataFrame.insert()` to tell pandas exactly where to stick the new column

In [24]:
del sf1['county_name']  
# drop the column we just created
sf1.insert(4, 'county_name', sf1['county'].replace(county_fips_to_name))
# tells Pandas to insert sf1 in 4th position
sf1.head(3)    
# show first 3 lines of sf1 table

,logrecno,blockfips,state,county,county_name,tract,blkgrp,block,arealand,P0010001,...,H0050005,H0050006,H0050007,H0050008,pct_black,pct_asian,pct_white,pct_hisp,pct_rent,pop_sqmi
1,26,060014271001001,06,001,Alameda,427100,1,1001,79696,113,...,0,0,0,0,13.274336,5.309735,78.761062,1.769912,80.0,3672.312839
3,28,060014271001003,06,001,Alameda,427100,1,1003,19546,29,...,0,0,0,2,13.793103,27.586207,37.931034,24.137931,70.0,3842.712166
4,29,060014271001004,06,001,Alameda,427100,1,1004,14364,26,...,0,0,0,0,0.000000,38.461538,34.615385,0.000000,75.0,4688.087441

Notice how `insert()` operates "in-place"?

### 3.1.2 Split-Apply-Combine

Groupby is a powerful method in pandas that follows the split-apply-combine approach to data manipulation.

<center><img src="images/groupby.png" width=75%></center>

source: Fig. 10-1 _Python for Data Analysis_, McKinney (2017)

**SPLIT**

Let's apply this approach to computing total population in each county in our dataset. First we create a groupby object, using county codes to group all the census blocks in sf1 into groups that share the same county code. This represents the **split** part of the workflow in the figure above

In [26]:
grouped = sf1[['P0010001', 'county_name']]
grouped

# preview data

        P0010001 county_name
1            113     Alameda
3             29     Alameda
4             26     Alameda
6              2     Alameda
7             30     Alameda
...          ...         ...
109220         3      Sonoma
109222         1      Sonoma
109224         9      Sonoma
109225        64      Sonoma
109226         5      Sonoma

[68797 rows x 2 columns]

**APPLY**

Now were ready to apply an operation to each group we've split. We call these **aggregation** methods because for each group they will take a series of values and combine them to produce one value, like a min/max/mean. pandas provides a bunch of built-in aggregation functions for use with `groupby` object. Some of the most common ones include:

* `count`
* `sum`
* `mean`
* `median`
* `std`, `var`
* `min`, `max`
* `idxmax`, `idxmin`
* `first`, `last`
* `quantile`

But you can also define and apply your own functions to use for aggregation.

In [39]:
grouped.groupby('county_name')
grouped

        P0010001 county_name
1            113     Alameda
3             29     Alameda
4             26     Alameda
6              2     Alameda
7             30     Alameda
...          ...         ...
109220         3      Sonoma
109222         1      Sonoma
109224         9      Sonoma
109225        64      Sonoma
109226         5      Sonoma

[68797 rows x 2 columns]

**COMBINE**

To apply your chosen aggregation, you can call it directly as a method of your `groupby` object. The object pandas returns will be the **combined** outputs of this method for each of your groups:

In [41]:
grouped.sum()
# should produce sum of population column (total_pop)

P0010001                                                 7150739
county_name    AlamedaAlamedaAlamedaAlamedaAlamedaAlamedaAlam...
dtype: object

**SPLIT-APPLY-COMBINE**

Doing this in two steps like above is really just to clarify the two parts of the split and apply process that happen within a groupy operation. Normally we would not bother separately creating a groupby object -- we would just do this in one line:

In [43]:
county_pop = sf1[['county_name', 'P0010001']].groupby('county_name').sum().rename(columns={'P0010001': 'total_pop'})
county_pop

# in one chained sequence: ____________ 
# and lastly rename last col into something more readable

               total_pop
county_name
Alameda          1510271
Contra Costa     1049025
Marin             252409
Napa              136484
San Francisco     805235
San Mateo         718451
Santa Clara      1781642
Solano            413344
Sonoma            483878

## 3.2 Aggregating on multiple columns

Let's merge the county totals with the original sf1 data

In [44]:
sf2 = pd.merge(sf1, county_pop, left_on='county_name', right_index=True)
sf2.head()

,logrecno,blockfips,state,county,county_name,tract,blkgrp,block,arealand,P0010001,...,H0050006,H0050007,H0050008,pct_black,pct_asian,pct_white,pct_hisp,pct_rent,pop_sqmi,total_pop
1,26,060014271001001,06,001,Alameda,427100,1,1001,79696,113,...,0,0,0,13.274336,5.309735,78.761062,1.769912,80.000000,3672.312839,1510271
3,28,060014271001003,06,001,Alameda,427100,1,1003,19546,29,...,0,0,2,13.793103,27.586207,37.931034,24.137931,70.000000,3842.712166,1510271
4,29,060014271001004,06,001,Alameda,427100,1,1004,14364,26,...,0,0,0,0.000000,38.461538,34.615385,0.000000,75.000000,4688.087441,1510271
6,31,060014271001006,06,001,Alameda,427100,1,1006,1281,2,...,0,0,0,0.000000,50.000000,0.000000,100.000000,100.000000,4043.697112,1510271
7,32,060014271001007,06,001,Alameda,427100,1,1007,19020,30,...,0,0,0,0.000000,43.333333,50.000000,0.000000,33.333333,4085.154574,1510271

Let's say we wanted to compute the population per square mile by county.  We could go ahead and create another dataframe with total area by county than then divide the total population by total area.

In [45]:
county_land = sf1[['county_name', 'arealand']].groupby(sf1['county_name']).sum()
county_land

# take sum of arealand

                 arealand
county_name
Alameda        1190434861
Contra Costa   1095085515
Marin          1046029032
Napa           1556005658
San Francisco    95535946
San Mateo       884654868
Santa Clara    2378681334
Solano         1224964331
Sonoma         3206326062

In [46]:
sq_m_to_sq_mi = 2589988.11 
county_pop['total_pop'] / county_land['arealand'] * sq_m_to_sq_mi
# converting square meters to square mi

county_name
Alameda           3285.844577
Contra Costa      2481.050329
Marin              624.969565
Napa               227.179082
San Francisco    21829.993454
San Mateo         2103.396042
Santa Clara       1939.911635
Solano             873.948750
Sonoma             390.864261
dtype: float64

Or, we could have done both aggregations at the same time!

In [47]:
county_totals = sf1[['county_name', 'P0010001', 'arealand']].groupby('county_name').sum()
county_totals['pop_density'] = county_totals['P0010001'] / county_totals['arealand'] * sq_m_to_sq_mi
county_totals

# Chained Assignment:
# take sf1 data the columns selected, group by county name, and sum the rest of the culumns not included in groupby
# outout

               P0010001    arealand   pop_density
county_name
Alameda         1510271  1190434861   3285.844577
Contra Costa    1049025  1095085515   2481.050329
Marin            252409  1046029032    624.969565
Napa             136484  1556005658    227.179082
San Francisco    805235    95535946  21829.993454
San Mateo        718451   884654868   2103.396042
Santa Clara     1781642  2378681334   1939.911635
Solano           413344  1224964331    873.948750
Sonoma           483878  3206326062    390.864261

What if we want to apply different aggregations to different columns?

In [ ]:
sf1.groupby('county_name').agg({'pct_asian': 'mean', 'P0010001': 'sum'})

# aggregation method takes dictionary (keys are columns & values are the operation to be performed)

**Question**

Sometimes I write `df[<list of columns>].groupby()`, but sometimes I just do `df.groupby()`. Why group subset of data frame vs. entire data frame?

Subset data by certain columns and perform operation rather than operating indiscriminately on all columns

## 3.3 Exercises:

Count the number of census blocks per county.

Calculate total households per county.

Calculate percent renters by county. (Careful not to calculate the mean percent rental across blocks in a county)

Calculate percent vacant by county.

Calculate mean, min and max pop_sqmi (at the block level) by county.

Calculate the 90th percentile of pop_sqmi (at the block level) by county.

In [ ]:
print('Number of census blocks per county:')

In [ ]:
print('Total households per county')

In [ ]:
print('percent renters by county')

In [ ]:
print('Percent vacant by county')

In [ ]:
print('Min, Max and Mean Population per SQMI by Census Block')

In [ ]:
print('90th Percentile of Population per SQMI at block level by County')

## 3.4 Cleaning Messy Data -- Craigslist Rental Listings

### 3.4.1 Loading data
Let's load some rental listings I scraped from Craigslist.

In [48]:
df = pd.read_csv('data/bay.csv')
df.head()

,neighborhood,title,price,beds_sqft,pid,longitude,date,subregion,link,latitude
0,(bayview),Take A TOUR ON OUR ONE FURNISHED BEDROOM TODAY,$950,/ 1br -,4076905111,-122.396965,Sep 18 2013,SF,/sfc/apa/4076905111.html,37.761216
1,(bayview),Only walking distance to major shopping centers.,$950,/ 1br -,4076901755,-122.396793,Sep 18 2013,SF,/sfc/apa/4076901755.html,37.761080
2,(bayview),"furnished - 1 Bedroom(s), 1 Bath(s), Air Condi...",$950,/ 1br -,4076899340,-122.397100,Sep 18 2013,SF,/sfc/apa/4076899340.html,37.762100
3,(financial district),"*NEW* Beautiful, Upscale Condo in Historic Jac...",$3300,/ 1br - 830ft² -,4067393707,-122.399747,Sep 18 2013,SF,/sfc/apa/4067393707.html,37.798108
4,(visitacion valley),楼上全层3房,$2000,/ 3br - 1280ft² -,4076901071,NaN,Sep 18 2013,SF,/sfc/apa/4076901071.html,NaN

It turns out to be pretty messy. What problems do you see?


- Neighborhood names are in parentheses...
- Bedrooms and Square Feet are embedded in a single string in the bedrooms column along with other text...
- Price is formatted as a string with a dollar sign...
- Date is a string in a non-standard format...

So how can we go about cleaning these data up to use them for analysis?

Let's start with cleaning up the Price and Neighborhood variables.

### 3.4.2 String Ops

In [49]:
df['price'] = df['price'].str.strip('$').astype('float64')
df['neighborhood'] = df['neighborhood'].str.strip().str.strip('(').str.strip(')')
df.head()

# need .str to use string operations
# strip will remove dollar signs and then convert to float for math operations
# strip white space from neighborhood, also strip ( left paren & right paren )

,neighborhood,title,price,beds_sqft,pid,longitude,date,subregion,link,latitude
0,bayview,Take A TOUR ON OUR ONE FURNISHED BEDROOM TODAY,950.0,/ 1br -,4076905111,-122.396965,Sep 18 2013,SF,/sfc/apa/4076905111.html,37.761216
1,bayview,Only walking distance to major shopping centers.,950.0,/ 1br -,4076901755,-122.396793,Sep 18 2013,SF,/sfc/apa/4076901755.html,37.761080
2,bayview,"furnished - 1 Bedroom(s), 1 Bath(s), Air Condi...",950.0,/ 1br -,4076899340,-122.397100,Sep 18 2013,SF,/sfc/apa/4076899340.html,37.762100
3,financial district,"*NEW* Beautiful, Upscale Condo in Historic Jac...",3300.0,/ 1br - 830ft² -,4067393707,-122.399747,Sep 18 2013,SF,/sfc/apa/4067393707.html,37.798108
4,visitacion valley,楼上全层3房,2000.0,/ 3br - 1280ft² -,4076901071,NaN,Sep 18 2013,SF,/sfc/apa/4076901071.html,NaN

OK, now lets create Year, Month and Day columns

In [50]:
df['month'] = df['date'].str.split().str[0]
df['day'] = df['date'].str.split().str[1].astype('int32')
df['year'] = df['date'].str.split().str[2].astype('int32')
df.head()

,neighborhood,title,price,beds_sqft,pid,longitude,date,subregion,link,latitude,month,day,year
0,bayview,Take A TOUR ON OUR ONE FURNISHED BEDROOM TODAY,950.0,/ 1br -,4076905111,-122.396965,Sep 18 2013,SF,/sfc/apa/4076905111.html,37.761216,Sep,18,2013
1,bayview,Only walking distance to major shopping centers.,950.0,/ 1br -,4076901755,-122.396793,Sep 18 2013,SF,/sfc/apa/4076901755.html,37.761080,Sep,18,2013
2,bayview,"furnished - 1 Bedroom(s), 1 Bath(s), Air Condi...",950.0,/ 1br -,4076899340,-122.397100,Sep 18 2013,SF,/sfc/apa/4076899340.html,37.762100,Sep,18,2013
3,financial district,"*NEW* Beautiful, Upscale Condo in Historic Jac...",3300.0,/ 1br - 830ft² -,4067393707,-122.399747,Sep 18 2013,SF,/sfc/apa/4067393707.html,37.798108,Sep,18,2013
4,visitacion valley,楼上全层3房,2000.0,/ 3br - 1280ft² -,4076901071,NaN,Sep 18 2013,SF,/sfc/apa/4076901071.html,NaN,Sep,18,2013

### 3.4.3 Datetime ops

pandas has special functions for dealing with `datetime` data types which make it much easier to do what we just did above. First we have to convert our date-like column to a `datetime` column

In [51]:
df['date'] = pd.to_datetime(df['date'])

Now we can use the `dt` method (just like `.str.` for string ops) to get month, day, year, and whatever else we want:

In [52]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month_name()
df['day'] = df['date'].dt.day
df['day_of_week'] = df['date'].dt.day_name()

# dt method to utilize date/time operators

In [ ]:
df[['date', 'day', 'month', 'year', 'day_of_week']].head()

### 3.4.4 Complex string processing

Let's see how we might extract the bedrooms...

In [ ]:
df.beds_sqft.sample(5)

In [ ]:
def clean_bdrm(value):

    if isinstance(value, str):
        end = value.find('br')

        if end == -1:
            return
        
        else:
            start = value.find('/') + 2
            return int(value[start:end])

    else:
        return

df['bedrooms'] = df['beds_sqft'].map(clean_bdrm)

In [ ]:
df[['bedrooms', 'beds_sqft']]

And the same approach might work for creating a sqft column.

In [ ]:
def clean_sqft(value):

    if isinstance(value, str):
        end = value.find('ft')
        
        if end == -1:
            return

        else:
            if value.find('br') == -1:
                start = value.find('/') + 2
            else:
                start = value.find('-') + 2

            return int(value[start:end])

    else:
        return

In [ ]:
df['sqft'] = df['beds_sqft'].map(clean_sqft)
df.head()

## 3.5 Summarizing your data

Let's have a look at a statistical profile of our data

In [ ]:
df.describe()

- Why are there different counts on the columns?
- How do the price (rent) variable ranges look?  1 dollar in rent as min?  35,000 in rent as  maximum?
- What about sqft?  1 sqft min and 12,700 sqft max?
- You are now in the realm of real-world data, with **outliers**!

## 3.6 Dealing with outliers
When we talk about **outliers**, we're not talking about the Malcom Gladwell kind. The kind of outliers we're talking about are the kind that are so far-fetched that they more likely represent bad data than real observations. And even if they are real, they're so amazingly rare that we don't want them to bias our analysis. In either case, we need to get rid of them.

In the case of our Craigslist listings, we'll do this in three steps:
1. Find outliers in rent, say the top and bottom 1%
1. Analyze the data without missing data
1. Create a dataset that removes the outliers

### 3.6.1 Price

Let's get a quantile value at the 1st percentile to see the value that the top one percent of our records exceed

In [ ]:
low = df['price'].dropna().quantile(.01)
print(low)

And now the top 1%

In [ ]:
high = df['price'].dropna().quantile(.99)
print(high)

<center><img src="https://static01.nyt.com/images/2021/01/26/multimedia/26xp-photog/26xp-photog-superJumbo.jpg" width=45%></center>

Now let's apply our filters:

In [ ]:
cleaned = df[(df['price'] < high) & (df['price'] > low)]

And maybe we can filter on # bedrooms, too. And why not drop rows with missing data while we're at it.

In [ ]:
cleaned = cleaned[cleaned['bedrooms'] < 4].dropna()
cleaned.describe()

## 3.7 Continuous vs Categorical Data

In [ ]:
from matplotlib import pyplot as plt
fig, axarr = plt.subplots(1, 2, figsize=(13,5))
cleaned['subregion'].value_counts(sort=False).plot(kind='bar', ax=axarr[0], title='Sub-region')
axarr[0].set_ylabel("count")
cleaned['price'].plot(kind='kde', ax=axarr[1], title='Price ($)')

### 3.7.1 Binning your data
Sometimes you'll want to convert a continuous variable to categorical. pandas provides us with a few options for doing this:
- `pd.cut()`: evenly _spaced_ bins, or define your own breaks
- `pd.qcut()`: evenly _populated_ bins, or define your own percentile breaks

#### 3.7.1.1 `pd.cut()`

In [ ]:
pd.cut(cleaned['price'], 3, labels=['low', 'medium', 'high']).value_counts(sort=False).plot(kind='bar')

In [ ]:
pd.cut(
    cleaned['price'], [0, 1000, 5000, 20000],
    labels=['low', 'medium', 'high']).value_counts(sort=False).plot(kind='bar')

#### 3.7.1.2 `pd.qcut()`

In [ ]:
pd.qcut(
    cleaned['price'], 5,
    labels=['very low', 'low', 'average', 'high', 'very high']).value_counts(sort=False).plot(kind='bar')

In [ ]:
pd.qcut(
    cleaned['price'], [0, .1, .3, .7, .9, 1],
    labels=['very low', 'low', 'medium', 'high', 'very high']).value_counts(sort=False).plot(kind='bar')

### 3.7.2 Dummy variables

Sometimes you might want to do the opposite: convert a categorical variable to a continuous or numeric variable. The way to do this is to create "dummy variables", where each category becomes its own _column_ with values that equal 1 if the _row_ belongs to the category and 0 otherwise:

In [ ]:
pd.get_dummies(cleaned['subregion']).sample(5)

You can then merge your dummy columns back onto the main dataframe

In [ ]:
cleaned.join(pd.get_dummies(cleaned['bedrooms'].astype(int), prefix='beds')).loc[:, 'bedrooms':].sample(5)

## 3.8 Putting it all together: Craigslist Rental Listings + SF1

Let's load another set of rental listings. This one is a dataset I've already cleaned for you. I've also geocoded the addresses to get lat/lon coordinates and Census Block IDs.

### 3.8.1 Merging data from two different sources

In [ ]:
rentals = pd.read_csv(
    'data/sfbay_geocoded.csv',
    usecols=['rent', 'bedrooms', 'sqft', 'fips_block', 'longitude', 'latitude'],
    dtype={'fips_block': str}  # load fips_block as str, numeric type will drop leading zero
)  
rentals.head()

And merge it with the census data using the FIPS block codes, which are named differently in the two DataFrames.

In [ ]:
rentals_sf1 = pd.merge(rentals, sf1, left_on='fips_block', right_on='blockfips')
rentals_sf1.head()

### 3.8.2 Multi-column group-by's

Now we can begin looking at this merged dataset.  Let's start by computing mean rents by county.

In [ ]:
county_rents = rentals_sf1.groupby(
    rentals_sf1['county_name'])[['rent']].mean().sort_values(by='rent', ascending=False)
county_rents.plot(kind='bar')

This result generally conforms to our expectations, with San Francisco having the highest average rent and Solano lowest. But what if Solano just has a higher percentage of 1 bedroom apartments? Could that bias our findings? How might we account for this possibility?

One way we could investigate the effect of total bedrooms is to include bedrooms as an additional segmentation variable:

In [ ]:
rentals_sf1.groupby(['county_name', 'bedrooms'])['rent'].mean().plot(kind='bar')

That bar chart is not ideal. Too small, and it would be nicer to make it separate colors for each number of bedrooms.  Also notice how the use of two groupby variables produces a MultiIndex, which makes for ugly axis labels at the very least.

We can use `unstack()` to convert one of the indices from row values to columns:

In [ ]:
rentals_sf1.groupby(['county_name', 'bedrooms'])[['rent']].mean().unstack()

Now we can plot a bar chart with the unstacked data, add a title, and set the figure size.

In [ ]:
rentals_sf1.groupby(
    ['county_name', 'bedrooms'])['rent'].mean().unstack().plot(
    kind='bar', figsize=(14,6), title='Average Rents by County and # Bedrooms', ylabel='rent ($)', xlabel='county')

Note that in one line of code we can filter, groupby, and plot our results.

**Question:** What's wrong with the plot above? Is it really showing us what we're interested in?

In [ ]:
rentals_sf1.groupby(
    ['bedrooms', 'county_name'])['rent'].mean().unstack().plot(
    kind='bar', figsize=(14,6), title='Average Rents by County and # Bedrooms', ylabel='rent ($)', xlabel='# bedrooms')

### 3.8.3 Pivot tables and Crosstabs

Remember when I said that in programming there is always more than one way to skin a cat? Here is another way of skinning this one that should look familiar to all of you excel power users out there:

In [ ]:
pd.pivot_table(rentals_sf1, values='rent', index=['bedrooms'], columns=['county_name']).plot(
    kind='bar', figsize=(14,6), title='Average Rents by County and Bedrooms')

The `pivot_table()` function makes it easy to add also can add partial totals, or "marginals", to our data:

In [ ]:
pd.pivot_table(rentals_sf1, values='rent', index='county_name', columns='bedrooms', margins=True)

Although mean is the default type of aggregation in pivot_table, you can use any aggregation method:

In [ ]:
pd.pivot_table(
    rentals_sf1, values='rent', index='county_name', columns='bedrooms', aggfunc="max", margins=True)

We could use the `count` aggregation method to get a full frequency distribution or cross-tabulation

But then again, there's an even simpler way to do this in pandas

In [ ]:
pd.crosstab(rentals_sf1['county_name'], rentals_sf1['bedrooms'], margins=True)

And the `crosstab()` function comes with its own bells and whistles. For example, setting `normalize=True` will tells us the fraction of the region's total listings that are in each combination of county and number of bedrooms.

In [ ]:
pd.crosstab(rentals_sf1['county_name'], rentals_sf1['bedrooms'], margins=True, normalize=True)

We could also normalize just the rows (index) or the just the columns:

In [ ]:
pd.crosstab(rentals_sf1['county_name'], rentals_sf1['bedrooms'], margins=True, normalize='index')

In [ ]:
pd.crosstab(rentals_sf1['county_name'], rentals_sf1['bedrooms'], margins=True, normalize='columns')

What if we want to look at more statistics than just mean? We can combine several aggregation methods and compute them at one time.

In [ ]:
rentals_sf1[rentals_sf1['bedrooms'] < 4].groupby(
    ['county_name', 'bedrooms'])['rent'].agg(['mean', 'std', 'min', 'max']).reset_index().head()

### 3.8.4 Exploring correlations in your data

Pandas provides simple ways of computing correlation coefficients among the columns in your DataFrame.

In [ ]:
rentals_sf1[['rent', 'sqft']].corr()

And this method can be combined with groupby to compute correlation tables by group.

In [ ]:
rentals_sf1.groupby('county_name')[['rent', 'sqft']].corr()

In [ ]:
rentals_sf1.groupby('bedrooms')[['rent', 'sqft']].corr()

### 3.8.5 Quantiles and User-defined Aggregation Functions

Below the `cut()` function to create categories for ranges of a variable. In this example we use 4 even intervals.

In [ ]:
sqft_cat = pd.cut(rentals_sf1['sqft'], 4)
sqft_cat.head()

Let's define our own aggregation function to get a standardized maximum rent for each sqft category. Standardization is the process of transforming your data such the the mean is 0 and the standard deviation is 1, which is accomplished by subtracting the mean and dividing by the standard deviation. By standardizing your data, you are able to make more generalized comparisons across groups.

In [ ]:
rentals_sf1.groupby(sqft_cat)['rent'].agg(
    max_rent='max', standardized_max=lambda x: (x.max() - x.mean()) / x.std())

So even though the smallest apartment size category has the lowest maximum rent, it is the most _extreme_ maximum rent relative to its group mean!

## 3.9 Exercises

Try practicing these techniques on your own, to do the following:

* Calculate the mean sqft of rental listings by county
* Calculate the standard deviation (std) of sqft of rental listings by county and bedroom
* Add a new column with a normalized sqft, substracting the mean sqft by bedroom from each listing's sqft 
* Compute correlation coefficients among rent, sqft, pct_white, pct_black, pct_asian and pct_hisp, by county and for the region
* Redo the statistical profile on rents by categories of sqft range using 10 quantiles rather than 4 equal bins